app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks" INNER JOIN "users" ON "users"."id" = "stocks"."user_id"
---
  def index
    @stock = Stock.joins(:user).all

SELECT  "stocks".* FROM "stocks" INNER JOIN "users" ON "users"."id" = "stocks"."user_id" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @stock = Stock.joins(:user).find(params[:id])
    @array = (0..@stock.duration_in_years).map do |year|

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @stock = Stock.find(params[:id])

INSERT INTO "stocks" ("name", "unit_price", "interest", "duration_in_years", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @stock = Stock.new(stock_params)

    if @stock.save

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "stocks" WHERE "stocks"."id" = ?  [["id", 1]]
---
  def destroy
    @stock = Stock.find(params[:id])
    @stock.destroy